# Moe's Bar Lab

### Introduction

In this lesson, we'll apply our knowlwedge of querying tables with has many through to ask questions of customers and bartenders at a bar.

### Loading Our Data

Create a new file called `moes_bar.sql` and then copy and paste the below into the file.

Make sure that you only copied the contents above and nothing else.

Once you have copied the SQL statements above, then run the following to create the database, and execute the code.

Then we can connect to our database with the following.

In [2]:
import sqlite3
conn = sqlite3.connect('./special_moes.db')
cursor = conn.cursor()

In [3]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[('bartenders',),
 ('customers',),
 ('drinks',),
 ('orders',),
 ('ingredients',),
 ('ingredients_drinks',)]

Next we load our data.

In [4]:
import pandas as pd
root_url = "https://raw.githubusercontent.com/jigsawlabs-student/mod-1-sql-curriculum/master/2-sql-relations/5-has-many-through-bar/"
names = ['bartenders', 'customers', 'drinks', 'orders', 'ingredients', 'ingredients_drinks']
loaded_dfs = [pd.read_csv(f'{root_url}{name}.csv') for name in names]

In [6]:
# for index, name in enumerate(names):
#     loaded_dfs[index].to_sql(f'{name}', conn, index = False)

In [7]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[('bartenders',),
 ('customers',),
 ('drinks',),
 ('orders',),
 ('ingredients',),
 ('ingredients_drinks',)]

In [8]:
pd.read_sql('select * from bartenders', conn)

   id   name     hometown  birthyear
0   1    moe  springfield       1965
1   2  selma    milwaukee       1970
2   3  patty       philly       1970

### Exploring our Database

Now we list of all of the tables with the following.

In [5]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

And then we can see the details of a particular table with the following.

In [28]:
cursor.execute("pragma table_info(customers)")
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'hometown', 'TEXT', 0, None, 0),
 (3, 'birthyear', 'INTEGER', 0, None, 0)]

### Making our queries

* Find the name of the youngest customer

In [23]:
youngest_customer = None

# cursor.execute(youngest_customer)
# cursor.fetchall()
# # [('lisa simpson', 2006)]

* Order the drinks from most to least expensive

In [24]:
cheapest_drinks = None

# cursor.execute(cheapest_drinks)
# cursor.fetchall()
# [('ice cream float', 8),
#  ('duff beer', 7),
#  ('gin and tonic', 7),
#  ('rootbeer', 6),
#  ('milkshake', 5),
#  ('egg cream soda', 3)]

In [16]:
orders = "SELECT * FROM customers"
pd.read_sql(orders, conn)

   id            name     hometown  birthyear
0   1    bart simpson  springfield       2008
1   2  maggie simpson    milwaukee       2016
2   3    lisa simpson       philly       2006

* Find the most expensive drink that bart simpson ordered

In [13]:
# orders = "SELECT * FROM drinks"
# pd.read_sql(orders, conn)

In [18]:
barts_orders = """SELECT DISTINCT(drinks.name) FROM drinks 
JOIN orders ON orders.drink_id = drinks.id
JOIN customers ON orders.customer_id = customers.id
WHERE customers.name = 'bart simpson' """

cursor.execute(barts_orders)
cursor.fetchall()
# [('milkshake', 5)]

{('egg cream soda',), ('milkshake',)}

In [24]:
tuple({'name': 'bart simpson'}.items())

(('name', 'bart simpson'),)

In [25]:
set([tuple({'name': 'bart simpson'}.items()), tuple({'name': 'bart simpson'}.items())])

{(('name', 'bart simpson'),)}

* Find a list of all of the customers of moe

In [58]:
# moes_customers = None

"'fred';DROP table users;"

def customers(bartender_name):
    customer_query = f"""SELECT DISTINCT(customers.id), customers.name FROM customers
    JOIN orders ON orders.customer_id = customers.id
    JOIN bartenders ON orders.bartender_id = bartenders.id
    WHERE bartenders.name = ?"""
    cursor.execute(customer_query, (bartender_name,))
    return cursor.fetchall()

In [59]:
customers('patty')

[(3, 'lisa simpson')]

In [60]:
pd.read_sql('select * from bartenders', conn)

   id   name     hometown  birthyear
0   1    moe  springfield       1965
1   2  selma    milwaukee       1970
2   3  patty       philly       1970

In [32]:
query = "SELECT * FROM orders ;"
pd.read_sql(query, conn)

   id  customer_id  drink_id  bartender_id
0   1            1         1             1
1   2            1         1             1
2   3            2         5             2
3   4            2         5             1
4   5            2         5             1
5   6            3         6             3
6   7            1         2             1
7   8            2         3             2
8   9            3         4             3

* Who is our most profitable customer

* Who is the most profitable bartender